{
  "Courses": [
    {
      "typ": "coding",
      "title": "Data Science with Python for Intermediate",
      "description": "This course takes you beyond basic Python and into real-world data analysis. You start by reviewing essential Python features that matter most for data work. Then you learn how to load, clean and transform messy datasets using Pandas and NumPy. Step by step, you practice building visualizations that highlight trends, patterns and anomalies. You also get an introduction to core machine learning ideas and simple models you can train yourself. By the end, you will feel confident exploring new datasets and presenting data-driven insights to others.",
      "video": "https://www.youtube.com/watch?v=HrRA67O-QXI",
      "image": "https://img.youtube.com/vi/ua-CiDNNj30/maxresdefault.jpg",
      "instructor": "Jose Portilla",
      "price": 150,
      "id": 10,
      "level": "Intermediate",
      "outcomes": [
        "Analyze real datasets using Pandas and NumPy",
        "Build visualizations to communicate data insights",
        "Train and evaluate basic machine learning models"
      ],
      "skills": [
        "Python",
        "Pandas",
        "NumPy",
        "Data Cleaning",
        "Data Visualization",
        "Machine Learning Basics"
      ]
    },
    {
      "typ": "coding",
      "title": "JavaScript Essentials for Beginner",
      "description": "This course gives you a friendly introduction to JavaScript from the very beginning. You will learn what variables, data types and operators are, and how to use them safely. Next, you practice writing conditions, loops and functions to make your code reusable and easier to understand. You will then move into the browser and see how JavaScript can change HTML and CSS in response to user actions. Along the way, you will debug common errors and understand how the browser executes your scripts. By the end, you will be ready to build small interactive components and move on to more advanced JavaScript topics.",
      "video": "https://www.youtube.com/watch?v=W6NZfCO5SIk",
      "image": "https://img.youtube.com/vi/W6NZfCO5SIk/maxresdefault.jpg",
      "instructor": "Mosh Hamedani",
      "price": 120,
      "id": 11,
      "level": "Beginner",
      "outcomes": [
        "Write basic JavaScript programs using variables, conditions and loops",
        "Manipulate the DOM to react to user actions",
        "Organize code using functions and simple modules"
      ],
      "skills": [
        "JavaScript Basics",
        "ES5 Syntax",
        "Functions",
        "Control Flow",
        "DOM Manipulation",
        "Debugging"
      ]
    },
    {
      "typ": "coding",
      "title": "HTML",
      "description": "This course teaches you how to build solid web pages using modern HTML from the ground up. You begin by understanding the structure of a web document and the role of the browser. Then you learn the most important tags for headings, paragraphs, images and links. After that, you will work with forms, tables and semantic elements that make your pages accessible and easy to maintain. Real examples show you how to organize content for blogs, landing pages and simple web apps. By the end, you will be able to turn a design or idea into clean, semantic HTML ready for styling and interactivity.",
      "video": "https://www.youtube.com/watch?v=qz0aGYrrlhU",
      "image": "https://img.youtube.com/vi/qz0aGYrrlhU/maxresdefault.jpg",
      "instructor": "Osama Elzero",
      "price": 100,
      "id": 1,
      "level": "Beginner",
      "outcomes": [
        "Structure web pages with clean semantic HTML",
        "Create forms, links, images and tables correctly",
        "Use HTML5 elements for media and layouts"
      ],
      "skills": [
        "HTML5",
        "Semantic Tags",
        "Forms",
        "Links & Images",
        "Tables",
        "Basic Accessibility"
      ]
    },
    {
      "typ": "coding",
      "title": "CSS",
      "description": "This course helps you turn plain HTML into attractive, professional-looking web pages using CSS. You start by learning how selectors, properties and the box model work together. Then you practice styling text, colors, spacing and backgrounds to create a consistent visual identity. The course guides you through building responsive layouts using Flexbox and CSS Grid. You also explore simple transitions and hover effects that make interfaces feel more polished. Throughout the lessons, you work on real sections like hero banners, cards and navigation bars. By the end, you will be able to style complete pages that look great on both desktop and mobile.",
      "video": "https://www.youtube.com/watch?v=1Rs2ND1ryYc",
      "image": "https://img.youtube.com/vi/1Rs2ND1ryYc/maxresdefault.jpg",
      "instructor": "Mohamed El Desouki",
      "price": 100,
      "id": 2,
      "level": "Beginner",
      "outcomes": [
        "Style web pages with colors, typography and spacing",
        "Build responsive layouts using Flexbox and Grid",
        "Create basic transitions and hover animations"
      ],
      "skills": [
        "CSS3",
        "Flexbox",
        "CSS Grid",
        "Responsive Design",
        "Typography",
        "Animations"
      ]
    },
    {
      "typ": "coding",
      "title": "The Complete JavaScript",
      "description": "This course is designed to take you from basic JavaScript knowledge to a strong, modern understanding of the language. You will revisit the fundamentals and quickly move into ES6+ features like arrow functions, classes and modules. With plenty of practice, you learn how to interact with the DOM, handle events and build dynamic UI behavior. The course also covers asynchronous programming, promises and working with remote APIs. You will build small projects that combine multiple concepts into real features. By the end, you will write cleaner, more structured JavaScript suitable for frameworks and larger applications.",
      "video": "https://www.youtube.com/watch?v=PkZNo7MFNFg",
      "image": "https://img.youtube.com/vi/PkZNo7MFNFg/maxresdefault.jpg",
      "instructor": "Jonas Schmedtmann",
      "price": 100,
      "id": 3,
      "level": "Intermediate",
      "outcomes": [
        "Use modern JavaScript features to write clean code",
        "Work with the DOM and browser events confidently",
        "Consume REST APIs and handle JSON data"
      ],
      "skills": [
        "Modern JavaScript",
        "ES6+ Syntax",
        "DOM & Events",
        "Async JS",
        "Fetch API",
        "Modules"
      ]
    },
    {
      "typ": "coding",
      "title": "Python for Everybody",
      "description": "This course introduces Python to complete beginners with a clear, step‑by‑step approach. You start with installing Python and writing your first simple programs. Then you learn about variables, conditions, loops and functions to structure your code. You will work with strings, lists and dictionaries to process different types of data. Later, you explore file handling and small real‑world tasks that can be automated with scripts. Each section reinforces the concepts with practical exercises. By the end, you will be comfortable writing basic Python programs and ready to move into more specialized areas.",
      "video": "https://www.youtube.com/watch?v=rfscVS0vtbw",
      "image": "https://img.youtube.com/vi/rfscVS0vtbw/maxresdefault.jpg",
      "instructor": "Charles Severance",
      "price": 100,
      "id": 4,
      "level": "Beginner",
      "outcomes": [
        "Write Python scripts that automate simple tasks",
        "Work with files, strings and collections",
        "Understand functions and basic error handling"
      ],
      "skills": [
        "Python Basics",
        "Control Flow",
        "Functions",
        "File Handling",
        "Lists & Dictionaries"
      ]
    },
    {
      "typ": "coding",
      "title": "The Complete Web Developer",
      "description": "This course walks you through the full web development stack using modern tools. You begin by mastering the fundamentals of HTML, CSS and JavaScript together. Then you see how these pieces connect to simple backends and APIs. Through guided projects, you build pages, forms and interactive components that mirror real websites. You also learn how to organize your files, manage assets and think about deployment. The focus is on building complete, functioning sites rather than isolated snippets. By the end, you will have a clear picture of how a full web project is structured from start to finish.",
      "video": "https://www.youtube.com/watch?v=Ke90Tje7VS0",
      "image": "https://img.youtube.com/vi/Ke90Tje7VS0/maxresdefault.jpg",
      "instructor": "Andrei Neagoie",
      "price": 100,
      "id": 5,
      "level": "Intermediate",
      "outcomes": [
        "Build full web pages using HTML, CSS and JavaScript",
        "Connect front‑end interfaces with simple backends",
        "Deploy a complete web project online"
      ],
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "REST APIs",
        "Basic Backend",
        "Deployment"
      ]
    },
    {
      "typ": "coding",
      "title": "Java Programming",
      "description": "This course teaches you how to think and build software in Java, one of the most widely used languages in the world. You start by learning the syntax, variables and basic control structures. Then you move into object‑oriented programming with classes, objects and methods. You will explore inheritance, polymorphism and interfaces to design flexible systems. The lessons also cover collections, error handling and working with files. Throughout the course, you build small programs that reflect real use cases. By the end, you will have the foundation needed for desktop apps, Android, or backend development in Java.",
      "video": "https://www.youtube.com/watch?v=grEKMHGYyns",
      "image": "https://img.youtube.com/vi/grEKMHGYyns/maxresdefault.jpg",
      "instructor": "Tim Buchalka",
      "price": 100,
      "id": 6,
      "level": "Intermediate",
      "outcomes": [
        "Write Java programs using classes and objects",
        "Apply OOP concepts like inheritance and polymorphism",
        "Work with collections and handle exceptions"
      ],
      "skills": [
        "Java Syntax",
        "OOP",
        "Collections",
        "Exception Handling",
        "File I/O"
      ]
    },
    {
      "typ": "coding",
      "title": "Learn PHP for Beginners",
      "description": "This course shows you how to create dynamic websites and simple backends using PHP. You begin by learning the basics of the language and how it integrates with HTML. Then you handle forms, user input and server‑side validation. You will connect your PHP scripts to a database so you can store and retrieve information. The course also introduces sessions and simple authentication concepts. Through small projects, you see how separate pages work together to form a real application. By the end, you will be able to build basic PHP sites that respond to user actions and data.",
      "video": "https://www.youtube.com/watch?v=OK_JCtrrv-c",
      "image": "https://img.youtube.com/vi/OK_JCtrrv-c/maxresdefault.jpg",
      "instructor": "Edwin Diaz",
      "price": 100,
      "id": 7,
      "level": "Beginner",
      "outcomes": [
        "Process form data and generate dynamic pages with PHP",
        "Connect PHP applications to a database",
        "Manage sessions and basic authentication"
      ],
      "skills": [
        "PHP Basics",
        "Forms",
        "Sessions",
        "MySQL Basics",
        "Server‑Side Rendering"
      ]
    },
    {
      "typ": "coding",
      "title": "The Complete Python Developer",
      "description": "This course is aimed at learners who already know Python basics and want to become productive developers. You start by revisiting core language features and improving code style. Then you build projects that interact with APIs, files and databases. The instructor guides you through organizing larger applications with packages and virtual environments. You will also touch on backend concepts and simple web services written in Python. Real examples help you understand how Python is used in professional environments. By the end, you will be able to structure and ship more serious Python applications.",
      "video": "https://www.youtube.com/watch?v=HGOBQPFzWKo",
      "image": "https://img.youtube.com/vi/HGOBQPFzWKo/maxresdefault.jpg",
      "instructor": "Andrei Neagoie",
      "price": 100,
      "id": 8,
      "level": "Intermediate",
      "outcomes": [
        "Build Python applications that interact with external APIs",
        "Structure larger projects using packages and virtual environments",
        "Work with databases and simple backends in Python"
      ],
      "skills": [
        "Intermediate Python",
        "APIs",
        "Virtual Environments",
        "Databases",
        "Backend Basics"
      ]
    },
    {
      "typ": "coding",
      "title": "Full-stack Web with node.js",
      "description": "This course focuses on building full‑stack JavaScript applications powered by Node.js. You begin by setting up a Node and Express server and understanding how HTTP requests work. Then you design REST APIs that send and receive JSON data. On the data side, you connect to databases and learn how to model and validate information. You will also see how front‑end clients talk to your backend and how to secure common routes. Throughout the course, you build and test features that feel like those in real products. By the end, you will be ready to create and maintain Node‑based web services.",
      "video": "https://www.youtube.com/watch?v=Oe421EPjeBE",
      "image": "https://img.youtube.com/vi/Oe421EPjeBE/maxresdefault.jpg",
      "instructor": "Andrew Mead",
      "price": 100,
      "id": 9,
      "level": "Intermediate",
      "outcomes": [
        "Create REST APIs with Node.js and Express",
        "Connect Node servers to databases",
        "Build and test full‑stack features end‑to‑end"
      ],
      "skills": [
        "Node.js",
        "Express",
        "REST APIs",
        "MongoDB or SQL Basics",
        "Authentication"
      ]
    },
    {
      "typ": "coding",
      "title": "Advanced CSS and Sass",
      "description": "This course is for developers who already know basic CSS and want to build scalable, modern user interfaces. You learn how to architect large stylesheets using Sass, variables and partials. The instructor shows you how to apply BEM and design‑system thinking to keep components consistent. You will build complex responsive layouts tailored for real products and dashboards. Advanced animations and transitions are used to bring interactions to life without hurting performance. By the end, you will be able to design and maintain professional‑grade CSS codebases for production websites.",
      "video": "https://www.youtube.com/watch?v=NuSkS6xX1g8",
      "image": "https://img.youtube.com/vi/NuSkS6xX1g8/maxresdefault.jpg",
      "instructor": "Jonas Schmedtmann",
      "price": 100,
      "id": 10,
      "level": "Advanced",
      "outcomes": [
        "Architect large CSS codebases using Sass and BEM",
        "Build complex responsive layouts for real products",
        "Create advanced animations and visual effects"
      ],
      "skills": [
        "Advanced CSS",
        "Sass",
        "BEM",
        "Design Systems",
        "Performance‑friendly Animations"
      ]
    },
    {
      "typ": "network",
      "title": "Cisco CCNA",
      "description": "This course prepares you for the Cisco CCNA exam while building strong hands‑on networking skills. You begin with IP addressing, subnetting and the core protocols behind modern networks. Then you configure routers and switches in realistic lab scenarios. You will work with VLANs, routing protocols and basic security concepts. Each module connects theory directly to command‑line practice on Cisco devices. The content is aligned with the official CCNA exam objectives. By the end, you will understand how small and medium networks are designed, deployed and troubleshot.",
      "video": "https://www.youtube.com/watch?v=pNN3_34TNYw",
      "image": "https://img.youtube.com/vi/pNN3_34TNYw/maxresdefault.jpg",
      "instructor": "Neil Anderson",
      "price": 100,
      "id": 1,
      "level": "Intermediate",
      "outcomes": [
        "Configure basic Cisco routers and switches",
        "Design and troubleshoot IPv4 and IPv6 networks",
        "Be ready for the CCNA 200‑301 exam topics"
      ],
      "skills": [
        "Routing & Switching",
        "Cisco IOS",
        "Subnetting",
        "VLANs",
        "Spanning Tree",
        "TCP/IP"
      ]
    },
    {
      "typ": "network",
      "title": "Networking Fundamentals",
      "description": "This course gives you a clear foundation in computer networking concepts. You start by understanding why networks exist and how devices communicate. The OSI and TCP/IP models are explained in plain language with real examples. You then learn about switches, routers and common network topologies. Basic IP addressing and subnetting help you see how traffic is directed. Hands‑on demos show what happens to packets as they move across a network. By the end, you will feel comfortable with the core ideas needed for further networking or certification study.",
      "video": "https://www.youtube.com/watch?v=tvL-nH9A4cM",
      "image": "https://img.youtube.com/vi/tvL-nH9A4cM/maxresdefault.jpg",
      "instructor": "David Bombal",
      "price": 100,
      "id": 2,
      "level": "Beginner",
      "outcomes": [
        "Explain the OSI and TCP/IP models in simple terms",
        "Identify key network devices and their roles",
        "Understand IP addressing and basic subnetting"
      ],
      "skills": [
        "Networking Basics",
        "OSI Model",
        "TCP/IP",
        "IP Addressing",
        "Switches & Routers"
      ]
    },
    {
      "typ": "network",
      "title": "Practical Ethical Hacking",
      "description": "This course focuses on real‑world ethical hacking skills in a structured way. You begin with reconnaissance and information gathering on target systems. Then you perform vulnerability scanning and understand how weaknesses are discovered. The instructor demonstrates common exploit techniques in safe lab environments. You also learn how to escalate privileges and maintain controlled access. Defensive strategies and reporting best practices are discussed so you know how professionals work. By the end, you will have a practical view of the offensive side of cybersecurity and how to use it ethically.",
      "video": "https://www.youtube.com/watch?v=0xh1a3x3SV8",
      "image": "https://img.youtube.com/vi/0xh1a3x3SV8/maxresdefault.jpg",
      "instructor": "Heath Adams",
      "price": 100,
      "id": 3,
      "level": "Intermediate",
      "outcomes": [
        "Perform basic reconnaissance and vulnerability scanning",
        "Exploit common weaknesses in lab environments",
        "Understand how to report findings ethically"
      ],
      "skills": [
        "Ethical Hacking",
        "Reconnaissance",
        "Vulnerability Scanning",
        "Metasploit Basics",
        "Reporting"
      ]
    },
    {
      "typ": "network",
      "title": "CompTIA Network+",
      "description": "This course helps you pass the CompTIA Network+ exam while building strong conceptual knowledge. You cover each exam domain, from networking basics to security and troubleshooting. Realistic diagrams and examples show how networks are planned and documented. You learn how to choose cables, devices and standards for different environments. Detailed troubleshooting sections walk you through diagnosing common wired and wireless issues. The training is structured so you can revisit topics easily while preparing. By the end, you will be well‑positioned to sit for the Network+ certification with confidence.",
      "video": "https://www.youtube.com/watch?v=4H3oFf71Ulg",
      "image": "https://img.youtube.com/vi/4H3oFf71Ulg/maxresdefault.jpg",
      "instructor": "Jason Dion",
      "price": 100,
      "id": 4,
      "level": "Intermediate",
      "outcomes": [
        "Master the main Network+ exam domains",
        "Troubleshoot common wired and wireless issues",
        "Select appropriate cables, devices and standards"
      ],
      "skills": [
        "Network+ Topics",
        "Troubleshooting",
        "Wireless Networking",
        "Cabling",
        "Protocols"
      ]
    },
    {
      "typ": "network",
      "title": "Cisco CCNP Enterprise",
      "description": "This advanced course targets network engineers preparing for Cisco CCNP Enterprise. You revisit routing and switching at a deeper, enterprise‑scale level. The instructor explains how to design resilient topologies using modern Cisco technologies. You work through advanced configurations for routing, switching and policy control. Automation and programmability topics show where networks are heading next. Design scenarios and labs train you to think like an enterprise architect. By the end, you will understand how large networks are built, optimized and prepared for CCNP exams.",
      "video": "https://www.youtube.com/watch?v=2xqHWI6l5sM",
      "image": "https://img.youtube.com/vi/2xqHWI6l5sM/maxresdefault.jpg",
      "instructor": "Kevin Wallace",
      "price": 100,
      "id": 5,
      "level": "Advanced",
      "outcomes": [
        "Design and implement enterprise‑grade Cisco networks",
        "Work with advanced routing and switching features",
        "Understand key topics for CCNP Enterprise exams"
      ],
      "skills": [
        "Advanced Routing",
        "Advanced Switching",
        "Enterprise Design",
        "Cisco Automation Basics"
      ]
    },
    {
      "typ": "network",
      "title": "Packet Analysis, Ethical Hacking",
      "description": "This course teaches you how to read and interpret network traffic at the packet level. You start with capturing packets using tools like Wireshark. Then you learn how to filter, search and decode different protocols. The instructor shows how normal traffic looks so that anomalies become easier to spot. You connect this knowledge to ethical hacking scenarios and attack detection. Case studies help you see how packet analysis supports investigations and penetration tests. By the end, you will be more comfortable understanding what is really happening on the wire.",
      "video": "https://www.youtube.com/watch?v=6x1B6fK-QxQ",
      "image": "https://img.youtube.com/vi/6x1B6fK-QxQ/maxresdefault.jpg",
      "instructor": "Zaid Sabih",
      "price": 100,
      "id": 6,
      "level": "Intermediate",
      "outcomes": [
        "Capture and inspect packets with Wireshark",
        "Identify suspicious traffic patterns and attacks",
        "Use packet analysis to support ethical hacking tests"
      ],
      "skills": [
        "Packet Analysis",
        "Wireshark",
        "Network Attacks",
        "Traffic Inspection"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Adobe Photoshop CC for Beginner",
      "description": "This course introduces Photoshop in a practical, project‑based way for new designers. You begin by exploring the interface, tools and essential panels. Then you learn how to work with layers, masks and selections to control edits precisely. Common photo‑retouching tasks are demonstrated step by step. You also design simple posters and social media graphics using text, shapes and images. Best practices for exporting files for web and print are covered. By the end, you will feel comfortable opening, editing and designing real visuals in Photoshop.",
      "video": "https://www.youtube.com/watch?v=OjRqZiAgoHo",
      "image": "https://img.youtube.com/vi/OjRqZiAgoHo/maxresdefault.jpg",
      "instructor": "Daniel Walter Scot",
      "price": 100,
      "id": 1,
      "level": "Beginner",
      "outcomes": [
        "Navigate the Photoshop interface with confidence",
        "Retouch and enhance basic photos",
        "Create simple posters and social media designs"
      ],
      "skills": [
        "Photoshop Basics",
        "Layers",
        "Selections",
        "Photo Retouching",
        "Text & Shapes"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "UI/UX Design Bootcamp for Intermediate",
      "description": "This course is a compact bootcamp for designers who want to deepen their UI/UX skills. You start with user‑centered design principles and how to understand user needs. Wireframing sessions help you translate ideas into clear layouts. Then you move into high‑fidelity UI design using tools like Figma or Adobe XD. You will create interactive prototypes to communicate flows and micro‑interactions. Feedback loops and usability thinking are built into the process. By the end, you will be able to plan, design and present interfaces like a professional UX designer.",
      "video": "https://www.youtube.com/watch?v=3qHkEd9kZbI",
      "image": "https://img.youtube.com/vi/3qHkEd9kZbI/maxresdefault.jpg",
      "instructor": "Caler Edwards",
      "price": 100,
      "id": 2,
      "level": "Intermediate",
      "outcomes": [
        "Plan user‑centered flows and information architecture",
        "Create wireframes and interactive prototypes",
        "Design clean UI screens consistent with a design system"
      ],
      "skills": [
        "UX Fundamentals",
        "Wireframing",
        "Prototyping",
        "UI Design",
        "Figma / XD"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Graphic Design Masterclass for Advanced",
      "description": "This course is a comprehensive journey through modern graphic design practice. You revisit the core principles of typography, color and composition with fresh, practical examples. Real projects demonstrate how to create strong layouts for both print and digital platforms. The instructor shows you how to build visual hierarchy and tell stories with design. You will also explore branding, logo creation and the process behind consistent identities. Portfolio‑ready assignments help you build real pieces as you learn. By the end, you will have the confidence to tackle complex design briefs with a professional mindset.",
      "video": "https://www.youtube.com/watch?v=AnfezdrB_-s",
      "image": "https://img.youtube.com/vi/AnfezdrB_-s/maxresdefault.jpg",
      "instructor": "Lindsay Marsh",
      "price": 100,
      "id": 3,
      "level": "Advanced",
      "outcomes": [
        "Apply typography and color theory in real projects",
        "Design complex layouts for print and digital",
        "Build a consistent visual identity and portfolio pieces"
      ],
      "skills": [
        "Typography",
        "Color Theory",
        "Layout Design",
        "Branding",
        "Print & Digital Graphics"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Web Design for Beginners for Beginner",
      "description": "This course introduces web design from a visual and structural perspective. You learn how HTML and CSS work together to create layouts users can navigate easily. Simple wireframing exercises help you plan sections before writing any code. You then style those layouts to match modern design trends and responsive behavior. The course emphasizes clarity, readability and user‑friendly decisions. Small projects guide you through building landing pages and basic sites. By the end, you will understand how to approach web design even if you are new to both design and development.",
      "video": "https://www.youtube.com/watch?v=B-ytMSuwbf8",
      "image": "https://img.youtube.com/vi/B-ytMSuwbf8/maxresdefault.jpg",
      "instructor": "Brad Schiff",
      "price": 100,
      "id": 4,
      "level": "Beginner",
      "outcomes": [
        "Design simple, user‑friendly web page layouts",
        "Understand how HTML and CSS work together visually",
        "Create responsive pages that look good on mobile"
      ],
      "skills": [
        "Basic Web Design",
        "Wireframes",
        "Layout",
        "Responsive Thinking"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Adobe Illustrator CC for Intermediate",
      "description": "This course helps you use Adobe Illustrator confidently for vector‑based design work. You start with shapes, paths and the Pen Tool to draw clean graphics. Then you learn to work with typography, icons and simple illustrations. Logo design exercises show how to combine concepts, grids and color. You also prepare artwork for export to print and digital formats. Attention is given to organizing layers and using reusable components. By the end, you will be able to create scalable illustrations and brand assets that look sharp everywhere.",
      "video": "https://www.youtube.com/watch?v=Ib8UBwu3yGA",
      "image": "https://img.youtube.com/vi/Ib8UBwu3yGA/maxresdefault.jpg",
      "instructor": "Daniel Walter Scott",
      "price": 100,
      "id": 5,
      "level": "Intermediate",
      "outcomes": [
        "Create vector illustrations and icons from scratch",
        "Design logos and simple brand assets",
        "Prepare artwork for print and web export"
      ],
      "skills": [
        "Illustrator Basics",
        "Pen Tool",
        "Vector Illustration",
        "Logo Design",
        "Exporting Assets"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Motion Design & Animation for Advanced",
      "description": "This course dives into motion design for those who already know the basics of design or video. You learn the core principles of animation such as timing, easing and anticipation. Using After Effects, you will animate text, shapes and UI elements step by step. The instructor demonstrates how to use keyframes, graphs and effects for polished results. You also explore how to structure motion projects for clients and export them in the right formats. Case studies show how motion supports branding and storytelling. By the end, you will be able to build short, professional motion graphics sequences.",
      "video": "https://www.youtube.com/watch?v=0p7EiZkqkUo",
      "image": "https://img.youtube.com/vi/0p7EiZkqkUo/maxresdefault.jpg",
      "instructor": "Jonathan Lam",
      "price": 100,
      "id": 6,
      "level": "Advanced",
      "outcomes": [
        "Animate text and graphic elements smoothly",
        "Use keyframes, easing and graph editors effectively",
        "Produce short motion graphics sequences for clients"
      ],
      "skills": [
        "After Effects",
        "Keyframing",
        "Motion Principles",
        "Compositing",
        "Rendering"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Design Essentials Adobe XD for Beginner",
      "description": "This course introduces Adobe XD as a fast and intuitive tool for UI design. You begin by setting up artboards and using basic shapes, text and components. Then you design simple app and website screens that follow common patterns. Interactive prototyping features show you how to link screens and add transitions. You also learn how to share designs with clients and developers for feedback and handoff. Best practices for organizing files and styles are covered throughout. By the end, you will be able to design and present clickable prototypes for your own ideas.",
      "video": "https://www.youtube.com/watch?v=68w2VwalD5w",
      "image": "https://img.youtube.com/vi/68w2VwalD5w/maxresdefault.jpg",
      "instructor": "Daniel Walter Sco",
      "price": 100,
      "id": 7,
      "level": "Beginner",
      "outcomes": [
        "Design basic app and website screens in XD",
        "Create interactive prototypes with links and transitions",
        "Share designs with developers and stakeholders"
      ],
      "skills": [
        "Adobe XD",
        "UI Layouts",
        "Interactive Prototypes",
        "Design Handoffs"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Canva Master Course for Intermediate",
      "description": "This course shows you how to go beyond templates and really master Canva. You start by understanding brand kits, layouts and how to keep designs consistent. Then you create social media posts, presentations and marketing materials step by step. The instructor shares tips for working quickly while still producing polished results. You explore how to collaborate with others and manage design assets in the cloud. Export settings for print and digital are explained clearly. By the end, you will be able to produce on‑brand graphics for different platforms using only Canva.",
      "video": "https://www.youtube.com/watch?v=gjwA1U7Y38Y",
      "image": "https://img.youtube.com/vi/gjwA1U7Y38Y/maxresdefault.jpg",
      "instructor": "Daniel Walter Scott",
      "price": 100,
      "id": 8,
      "level": "Intermediate",
      "outcomes": [
        "Design consistent social media and marketing graphics",
        "Use Canva templates efficiently and customize them",
        "Export designs correctly for print and digital"
      ],
      "skills": [
        "Canva",
        "Social Media Design",
        "Presentations",
        "Brand Assets"
      ]
    },
    {
      "typ": "ux_ui",
      "title": "Mastering Photoshop for Advanced",
      "description": "This course is aimed at designers who want to push Photoshop to a professional level. You work on complex composites built from multiple images and advanced masking. Color correction and grading techniques are demonstrated in real projects. You also explore creative effects, lighting and digital painting workflows. The instructor shares tips for organizing large files and working efficiently with layers. Portfolio‑style assignments help you practice the full process from raw images to final artwork. By the end, you will be able to create polished visuals suitable for campaigns, portfolios and client work.",
      "video": "https://www.youtube.com/watch?v=IyR_uYsRdPs",
      "image": "https://img.youtube.com/vi/IyR_uYsRdPs/maxresdefault.jpg",
      "instructor": "Aaron Nace",
      "price": 90,
      "id": 9,
      "level": "Advanced",
      "outcomes": [
        "Create complex composites from multiple images",
        "Apply advanced masking and color grading techniques",
        "Build polished artwork suitable for portfolio pieces"
      ],
      "skills": [
        "Advanced Photoshop",
        "Compositing",
        "Advanced Masking",
        "Color Grading",
        "Digital Art"
      ]
    }
  ]
}
